{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ca9d6e7e",
   "metadata": {},
   "source": [
    "# Домашнее задание №3\n",
    "## (Адаптационный курс)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ceba6e3f",
   "metadata": {},
   "source": [
    "**Задача №1** \n",
    "\n",
    "Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество уникальных гео-меток всех пользователей.\n",
    "\n",
    "*Пример работы программы:*\n",
    "\n",
    ">ids = {'user1': [213, 213, 213, 15, 213], \n",
    "\n",
    ">'user2': [54, 54, 119, 119, 119], \n",
    "\n",
    ">'user3': [213, 98, 98, 35]}\n",
    "\n",
    ">Результат: {98, 35, 15, 213, 54, 119}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "93f25a05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{98, 35, 15, 213, 54, 119}\n"
     ]
    }
   ],
   "source": [
    "ids = {'user1': [213, 213, 213, 15, 213], \n",
    "       'user2': [54, 54, 119, 119, 119], \n",
    "       'user3': [213, 98, 98, 35]}\n",
    "\n",
    "ids_list = [] #создаем список, куда запишем значения из словаря\n",
    "for items in ids.values(): #через values() возвращаем все значения словаря - списки идентификаторов.\n",
    "#if type(items) == list: #ОПЦИОНАЛЬНО проверяем, что значения являются списками \n",
    "    ids_list += items #добавляем в наш список все значения - списки из словаря, чтобы получить все гео-метки\n",
    "print(set(ids_list)) #открываем все списки из списка ids_list и удаляем из него дубликаты "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc341ce3",
   "metadata": {},
   "source": [
    "**Задача №2**\n",
    "\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "*Пример работы программы:*\n",
    "    \n",
    ">queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт',\n",
    "]\n",
    "\n",
    ">Результат:\n",
    "\n",
    ">Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "\n",
    ">Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d770081d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n",
      "Поисковых запросов, содержащих 2 слов(а): 42.86%\n"
     ]
    }
   ],
   "source": [
    "queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт',\n",
    "]\n",
    "total_queries = len(queries) #всего запросов\n",
    "word_counter = {} #пропишем в словаре, сколько запросов состоят из 2 и 3 слов в словаре\n",
    "\n",
    "for query in queries:\n",
    "    count = len(query.split())    #считаем количество слов в запросе\n",
    "    if count not in word_counter: #если статистики по такому кол-ву слов нет,\n",
    "                                  #фиксируем такой тип запросов в словаре\n",
    "        word_counter[count] = 0\n",
    "    word_counter[count] += 1  # увеличиваем счетчик для конкретного типа запроса\n",
    "\n",
    "for count, number in word_counter.items(): #обращаемся к значению для каждого типа запросов из словаря\n",
    "                                           #и выводим для них искомую статистику\n",
    "    answer = (number / total_queries) * 100 \n",
    "    print(f\"Поисковых запросов, содержащих {count} слов(а): {answer:.2f}%\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
